{
  "complaints": [
    {
      "id": 0.2608242696194605,
      "department": "Railway Safety",
      "category": "Passenger Safety",
      "priority": "High",
      "description": "**Subject:**  Overcrowding and dangerous travel conditions on trains.\n\n**Description:**\n* The image shows a train with a large number of passengers travelling on the exterior of the train, hanging out of the doors and windows. This is an extremely dangerous practice that puts the lives of passengers at risk. \n* This situation is unacceptable and needs to be addressed immediately.\n* The Railway Department needs to take action to prevent overcrowding on trains and ensure that passengers are travelling safely.\n\n**Recommendations:**\n* Increase the number of trains and carriages to accommodate the demand for travel.\n* Implement stricter measures to prevent passengers from travelling on the exterior of the train.\n* Educate passengers about the dangers of travelling on the exterior of the train.\n*  Enforce safety regulations and penalties for those who violate them. \n\n**Action Requested:**\n* Investigate the situation and take appropriate action to prevent overcrowding and ensure passenger safety.\n* Implement a plan to address the root cause of overcrowding and ensure safe travel conditions."
    },
    {
      "id": 0.8150262053500152,
      "department": "Railway Catering",
      "category": "Food Quality",
      "priority": "High",
      "description": "- **Subject:** Unhygienic food served on train\n- **Description:**  The food provided in the train was unhygienic and not fit for consumption. The omelette was not cooked properly and the bread was stale. This is a serious health hazard and should not be tolerated."
    },
    {
      "id": 0.5345002650996094,
      "department": "Rolling Stock",
      "category": "Coach Maintenance",
      "priority": "Medium",
      "description": "- **Subject:** Dirty and Unhygienic Coach\n- **Description:** The coach appears to be dirty and in need of cleaning. The windows are also dirty, which can affect the passenger's view and overall experience."
    }
  ]
}